0.Base/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            totalTemperature;
        T0              $internalField;
        value           $internalField;
	gamma		1.4;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(extrusions|walls|propeller|rotorWalls|blades|propellerTip)"
    {
        type            zeroGradient;
    }


    cyclicAMI
    {
        type            cyclicAMI;
    }
}

// ************************************************************************* //
