0.Base/Z
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Z;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(extrusions|walls|rotorWalls|propeller|blades|propellerTip)"
    {
        type            fixedValue;
        value           $internalField;
    }

    cyclicAMI
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
