0.Base/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101300;

boundaryField
{

    inlet
    {
        type            totalPressure;
        p0              $internalField;
        value           $internalField;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(extrusions|walls|rotorWalls|propeller|blades|propellerTip)"
    {
        type            zeroGradient;
    }

    cyclicAMI
    {
        type            cyclicAMI;
    }
}


// ************************************************************************* //
