system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    rotatingZone
    {
        type        faceZone;
        zoneName    rotatingZone;

        patches
        {
            master
            {
                name            rotZoneAMI1;
                type            cyclicAMI;
                neighbourPatch  rotZoneAMI2;
            }

            slave
            {
                name            rotZoneAMI2;
                type            cyclicAMI;
                neighbourPatch  rotZoneAMI1;
            }
        }
    }

}


// ************************************************************************* //
