system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type       limitTemperature;
    min        200;
    max        1000;
    selectionMode all;
}

limitV
{
    type       limitVelocity;
    min        -500;
    max        500;
    selectionMode all;
}

/*energySource
{
    type                scalarCodedSource;
    fields              (h);
    active              true;
    selectionMode       cellZone; // all, cellSet, cellZone, points
    cellZone            rotatingZone;

    codeAddSup
    #{
        const scalarField& rho=fieldNames_[rho]
        const scalarField& u=fieldNames_[u]
        const scalarField& Ut=fieldNames_[Ut]

        scalarField& heSource = eqn.source();
        forAll(rho, i)
        {
            // cell volume specific source
            heSource[i] += div(rho[i]*u[i]*Ut[i]);
        };
    }#
}*/

//************************************************************************** //
