system/residuals
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

residuals1{
    type           residuals;
    libs           ("libutilityFunctionObjects.so");
    enabled        true;
    writeControl   timeStep;
    writeInterval  1;
    fields
    (
     U
     p
    );
}

// ************************************************************************* //
